# Напишіть програму-калькулятор, в якій користувач зможе обрати операцію, ввести необхідні числа
# та отримати результат. Операції, які необхідно реалізувати: додавання, віднімання, множення, ділення,
# зведення в ступінь, квадратний корінь, кубічний корінь, синус, косинус та тангенс числа.

import math

s = float(input("""Оберіть арифметичну операцію: 
1 додавання 
2 віднімання 
3 множення 
4 ділення 
5 зведення в ступінь (k ** n) 
6 квадратний корінь (тільки першого числа) 
7 кубічний корінь (тільки першого числа) 
8 sin (тільки першого числа) 
9 cos (тільки першого числа) 
10 tg (тільки першого числа) 
"""))

k = float(input("Введіть перше число: "))
if s in [1, 2, 3, 4, 5]:
    n = float(input("Введіть друге число: "))

if s == 1:
    d = k + n
elif s == 2:
    d = k - n
elif s == 3:
    d = k * n
elif s == 4:
    if n != 0:
        d = k / n
    else:
        d = "Ділення на нуль!"
elif s == 5:
    d = k ** n
elif s == 6:
    d = math.sqrt(k)
elif s == 7:
    d = k ** (1/3)
elif s == 8:
    d = math.sin(k)
elif s == 9:
    d = math.cos(k)
elif s == 10:
    d = math.tan(k)
else:
    d = "Неправильний вибір операції"

print("Результат = ", d)

